# St7SetSolverLoadCaseCablePreLoad

Sets the load case that specifies the pre-loads applied to cable elements.

long St7SetSolverLoadCaseCablePreLoad(long uID, long CaseNum)

Input Parameters

uID

Strand7 model file ID.

CaseNum

Load case number.

Applicability

Applicable to linear transient dynamic analysis.